@manish-hashicorp There are several possible scenarios. For this problem to be silent the credential has to have access to both projects, but if it doesn't, the resource using the old project will fail to read instead of destroying and creating. 

I ran an example to get the output for different use cases. 

In the following examples I am using the configuration: 
```hcl
terraform {
  required_providers {
    hcp = {
      source  = "hashicorp/hcp"
      version = ">=0.65.0"
    }
  }
}
variable "project_id" {
  description = "The project id."
  type        = string
}
provider "hcp" {
  project_id = var.project_id
}

resource "hcp_service_principal" "example" {
  name   = "example-sp"
}
```
1. Org credentials with access to both projects. First, create the service principal in the provider's default project.
```shell
tf-help git:(main) ✗ terraform apply -var="project_id=ac8e2f32-37de-492f-9a2d-51c3b9a03089"

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcp_service_principal.example will be created
  + resource "hcp_service_principal" "example" {
      + name          = "example-sp"
      + parent        = (known after apply)
      + resource_id   = (known after apply)
      + resource_name = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

hcp_service_principal.example: Creating...
hcp_service_principal.example: Creation complete after 0s [name=example-sp]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
Then re-apply changing the provider's default project. 
```shell
➜  tf-help git:(main) ✗ terraform apply -var="project_id=82950878-75b8-464a-bb02-8d07f6083085"
hcp_service_principal.example: Refreshing state... [name=example-sp]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
➜  tf-help git:(main) ✗ 
```
The service principal continues in the old project and is not created in the new one. 